In [1]:
import pandas as pd

data = pd.DataFrame([
    {
        'index': 1,
        'name': 'Bill',
        'credit_card_number': '1111222233334444'
    },
    {
        'index': 2,
        'name': 'Jeff',
        'credit_card_number': '0000000000000000'
    },
    {
        'index': 3,
        'name': 'Bill',
        'credit_card_number': '9999999999999999'
    },
    {
        'index': 4,
        'name': 'Joe',
        'credit_card_number': '8888888888888888'
    },
])

In [2]:
data

  credit_card_number  index  name
0   1111222233334444      1  Bill
1   0000000000000000      2  Jeff
2   9999999999999999      3  Bill
3   8888888888888888      4   Joe

In [3]:
metadata = {
    "tables": [
        {
            "fields": [
                {
                    "name": "index",
                    "type": "id"
                },
                {
                    "name": "name",
                    "type": "categorical",
                    "pii": True,
                    "pii_category": "first_name"
                },
                {
                    "name": "credit_card_number",
                    "type": "categorical",
                    "pii": True,
                    "pii_category": [
                        "credit_card_number",
                        "visa"
                    ]
                }
            ],
            "name": "anonymized",
            "primary_key": "index",
        },
        {
            "fields": [
                {
                    "name": "index",
                    "type": "id"
                },
                {
                    "name": "name",
                    "type": "categorical"
                },
                {
                    "name": "credit_card_number",
                    "type": "categorical"
                }
            ],
            "name": "normal",
            "primary_key": "index",
        }
    ]
}

In [4]:
tables = {
    'anonymized': data,
    'normal': data.copy()
}

In [5]:
from sdv import SDV

sdv = SDV()
sdv.fit(metadata, tables)

2019-11-22 22:11:58,851 - INFO - modeler - Modeling anonymized
2019-11-22 22:11:58,852 - INFO - metadata - Loading transformer CategoricalTransformer for field name
2019-11-22 22:11:58,852 - INFO - metadata - Loading transformer CategoricalTransformer for field credit_card_number
2019-11-22 22:11:58,901 - INFO - modeler - Modeling normal
2019-11-22 22:11:58,901 - INFO - metadata - Loading transformer CategoricalTransformer for field name
2019-11-22 22:11:58,902 - INFO - metadata - Loading transformer CategoricalTransformer for field credit_card_number
2019-11-22 22:11:58,922 - INFO - modeler - Modeling Complete

In [6]:
sampled = sdv.sample_all()

In [7]:
sampled['anonymized']

   index      name credit_card_number
0      0     Karen   4296901743681193
1      1  Samantha   4296901743681193
2      2     Karen   4271300383612346
3      3     Karen   4087112820119247
4      4  Samantha   4306519196126983

In [8]:
sampled['normal']

   index  name credit_card_number
0      0  Bill   1111222233334444
1      1   Joe   1111222233334444
2      2  Bill   8888888888888888
3      3  Jeff   1111222233334444
4      4  Bill   8888888888888888